INSERT INTO users (password, email, sex, age, qualification_type_cd, city_type_cd, nickname, salary, salary_day, deleted_yn, created_at, updated_at) VALUES
('123456', 'hana@gmail.com', 'W', 23, 'PROFESSION', 41135, '김하나', 300, 25, 0, '2024-01-12 11:57:10', '2024-06-03 10:01:11'),
('000000', 'go@gmail.com', 'M', 24, 'PROFESSION', 41135, '고영우', 300, 15, 0, '2024-01-12 11:58:10', '2024-06-03 10:01:11'),
('111111', 'do@gmail.com', 'W', 23, 'PROFESSION', 11230, '도승희', 400, 15,  0, '2024-01-13 11:27:35', '2024-05-29 11:27:35'),
('222222', 'shin@gmail.com', 'W', 23, 'ENTERPRISE', 28245, '신명지', 250, 5, 0, '2024-01-14 11:57:10', '2024-05-18 11:57:10'),
('333333', 'lee@gmail.com', 'W', 23, 'OFFICE', 41220, '이서하', 200, 5, 0, '2024-01-15 11:57:10', '2024-05-18 11:57:10'),
('961024', 'jaegun@gmail.com', 'W', 27, 'SELF_EMP', 11470, '정재건', 1000, 25, 0, '2024-01-16 11:57:10', '2024-06-01 11:57:10');

INSERT INTO user_goals (user_id, goal_alias, goal_type_cd, goal_specific_id, goal_begin_date, duration, amount, deleted_yn, created_at, updated_at) VALUES
(1, '첫 차 구매', 'CAR', 87, '20240125', 60, 68800000, 0, '2024-01-25 09:00:05', '2024-01-25 09:00:05'),
(1, '25년 여름 유럽 여행', 'WISH', 1, '20240325', 12, 6000000, 0, '2024-03-25 09:00:05', '2024-03-25 09:00:05'),
(1, '이사 전세자금 마련', 'HOUSE', 10, '20240525', 120, 100000000, 0, '2024-05-25 09:00:05', '2024-05-25 09:00:05');

INSERT INTO wishes (wish_nm, wish_price, deleted_yn, created_at, updated_at)
VALUES ('25년 여름 유럽 여행', 6000000, 0, '2024-03-25 09:00:05', '2024-03-25 09:00:05');

INSERT INTO products (product_nm, interest_type_cd, interest_rate, image_url, info, term_year, cautions, deposit_protection, contract_terms, deleted_yn) VALUES
('하나 아이키움 적금', 'FIX', '4.00', NULL, '아동 양육을 위한 수당(영아[부모급여],아동,양육수당) 수급자 및 임산부 대상 우대 금리를 제공하고, 다자녀 가구 대상 특별 우대금리를 제공하는 상품', 1, '서류 확인을 통해 (특별)우대금리 적용 대상 여부 확인이 필요한 경우에는 가까운 하나은행 영업점을 방문하여 해당서류를 제출하여야 합니다. (아동 명의로 계좌로 수당 수급을 확인하는 경우, 임산부임을 확인하는 경우, 다자녀 가구임을 확인하는 경우)\n“하나 합 서비스”는 여러 기관에 흩어진 내 자산·지출 정보를 한눈에 조회하고 관리할 수 있는 마이데이터 기반 하나은행 자산관리 서비스입니다.', '이 예금은 예금자보호법에 따라 원금과 소정의 이자를 합하여 1인당 "5천만원까지"(하나은행의 여타 보호 상품과 합산) 보호됩니다.', '가입대상 : 실명의 개인 및 개인사업자 (1인 1계좌), 가입금액 : 1만원 이상 ~ 30만원 이하, 이자지급방법 : 만기일시지급식 : 만기(후)해지시 이자를 지급', 0),
('하나 청년도약계좌', 'FIX', '5.50', NULL, '청년의 중장기 자산형성 지원을 위한 금융 상품으로, 정부 기여금 및 비과세 혜택을 제공하는 적립식 상품', 5, '상품가입전 서민금융진흥원을 통해 가입자격 충족여부를 확인합니다.\n만기일이 휴일인 경우, 익영업일이후 해지 가능합니다.\n(만기일전 해지시 비과세 및 정부기여금 혜택을 받을 수 없고, 중도해지이율 적용됩니다.)\n이 적금 가입시 서민금융진흥원이 가입자에게 지급하는 정부기여금의 지급조건, 지급액, 지급시기 및 방법 등에 동의한것으로 봅니다.\n이 예금은 비과세 혜택 및 본인 적립금에 매칭하여 정부기여금을 지급하는 상품입니다.\n(본인 적립금 미납입시, 정부기여금 지급되지 않음)\n이 예금은 ‘하나은행’과 ‘서민금융진흥원’의 업무협약에 의해 운영되는 상품으로, 향후 업무협약 및 관련법 등의 변경에 따라 상품내용이 변경될 수 있습니다.\n서민금융진흥원에서 정한 정부기여금 지급기준 및 세제혜택 관련 법령(조세특례제한법 제91조의22)에서 정하는 바를 따릅니다.\n입금거래 정정(취소·변경 등)은 당월(입금월 초일부터 말일까지)에만 가능합니다.', '이 예금은 예금자보호법에 따라 원금과 소정의 이자를 합하여 1인당 "5천만원까지"(하나은행의 여타 보호 상품과 합산) 보호됩니다.', '가입대상 : 가입일 현재 만 19세 이상~만 34세 이하인 자 / 직전년도 총 급여액이 7,500만원 이하인 경우 / 가입일 현재 직전 과세기간의 가구소득이 직전년도 기준중위소득의 250% 이하일 것 / 가입일 현재 직전 과세기간의 가구소득이 직전년도 기준중위소득의 180% 이하일 것, 가입금액 : 매월 1천원 이상 ~ 70만원 이하, 이자지급방법 : 만기일시지급식 : 만기(후)해지시 이자를 지급', 0),
('펫사랑 적금', 'FIX', '2.80', NULL, '펫코노미 시대(반려인 1,500만명) 반려동물을 위한 목돈마련 저축상품', 1, '만기일 전에 중도해지시 약정금리보다 낮은 중도해지금리가 적용됩니다.\n일부해지 후 월 납입액은 최초 납입액과 달라지므로 유의하시기 바랍니다.\n→일부해지 후 월 납입액 : 최초 월 납입액 – (일부해지금액/납입횟수)\n적금의 중도해지시 반려동물 배상책임보험서비스 무료가입 보장기간도 종료됩니다.', '이 예금은 예금자보호법에 따라 원금과 소정의 이자를 합하여 1인당 "5천만원까지"(하나은행의 여타 보호 상품과 합산) 보호됩니다.', '가입대상 : 실명의 개인 및 개인사업자 (1인 1계좌), 가입금액 : 월 10만원 ~ 50만원 이하, 이자지급방법 : 만기일시지급식 : 만기(후)해지시 이자를 지급', 0),
('급여하나 월복리 적금', 'FIX', '4.45', NULL, '급여 하나로 OK! 월복리로 이자에 이자가 OK!', 1, '만기일전에 중도해지 시 약정한 금리보다 낮은 중도해지금리가 적용됩니다.\n이 예금은 만기일 전일까지 기간에 대하여 월복리로 이자를 계산하여 지급하며, 중도해지금리(일부해지 포함) 및 만기후금리는 단리로 계산하여 지급합니다.\n자동재예치 등록계좌는 만기일에 계좌별 최대 3회까지 자동재예치되므로, 재예치횟수 3회가 초과되는 경우에는 더 이상 재예치되지 않습니다.', '이 예금은 예금자보호법에 따라 원금과 소정의 이자를 합하여 1인당 "5천만원까지"(하나은행의 여타 보호 상품과 합산) 보호됩니다.', '가입대상 : 실명의 개인 및 개인사업자 (1인 1계좌), 가입금액 : 월 1만원 이상 300만원 이하, 이자지급방법 : 만기일시지급식 : 만기(후)해지시 이자를 지급', 0),
('(내맘) 적금', 'FIX', '3.75', NULL, '저축금액, 만기일, 자동이체 구간까지 내 맘대로 디자인하는 DIY적금', 1, '만기일 전에 중도해지 시 약정한 금리보다 낮은 중도해지금리가 적용됩니다.\n계좌별칭은 계좌조회>계좌관리>계좌별칭변경에서 등록 및 변경 가능합니다.\n우대금리는 만기 해지 시 제공하며, 일부 해지 및 중도해지 시에는 제공하지 않습니다.', '이 예금은 예금자보호법에 따라 원금과 소정의 이자를 합하여 1인당 "5천만원까지"(하나은행의 여타 보호 상품과 합산) 보호됩니다.', '가입대상 : 실명의 개인 및 개인사업자 (1인 1계좌), 가입금액 : 매월 1천원 이상 ~ 1천만원 이하, 이자지급방법 : 만기일시지급식 : 만기(후)해지시 이자를 지급', 0),
('연금하나 월복리 적금', 'FIX', '4.45', NULL, '연금 하나로 OK! 월복리로 이자에 이자가 OK!', 1, '만기일전에 중도해지 시 약정한 금리보다 낮은 중도해지금리가 적용됩니다.\n이 예금은 만기일 전일까지 기간에 대하여 월복리로 이자를 계산하여 지급하며, 중도해지금리(일부해지 포함) 및 만기후금리는 단리로 계산하여 지급합니다.\n자동재예치 등록계좌는 만기일에 계좌별 최대 3회까지 자동재예치되므로, 재예치횟수 3회가 초과되는 경우에는 더 이상 재예치되지 않습니다.', '이 예금은 예금자보호법에 따라 원금과 소정의 이자를 합하여 1인당 "5천만원까지"(하나은행의 여타 보호 상품과 합산) 보호됩니다.', '가입대상 : 실명의 개인 및 개인사업자 (1인 1계좌), 가입금액 : 1만원 이상 300만원 이하, 이자지급방법 : 만기일시지급식 : 만기(후)해지시 이자를 지급', 0),
('주거래하나 월복리 적금', 'FIX', '5.05', NULL, '공과금, 카드대금 이체 등 각종 주거래 건수에 따라 우대금리가 제공되는 월복리 적금!', 2, '만기일전에 중도해지 시 약정한 금리보다 낮은 중도해지금리가 적용됩니다.\n이 예금은 만기일 전일까지 기간에 대하여 월복리로 이자를 계산하여 지급하며, 중도해지금리(일부해지 포함) 및 만기후금리는 단리로 계산하여 지급합니다.\n자동재예치 등록계좌는 만기일에 계좌별 최대 3회까지 자동재예치되므로, 재예치횟수 3회가 초과되는 경우에는 더 이상 재예치되지 않습니다.', '이 예금은 예금자보호법에 따라 원금과 소정의 이자를 합하여 1인당 "5천만원까지"(하나은행의 여타 보호 상품과 합산) 보호됩니다.', '가입대상 : 실명의 개인 및 개인사업자 (1인 1계좌), 가입금액 : 1만원 이상 300만원 이하, 이자지급방법 : 만기일시지급식 : 만기(후)해지시 이자를 지급', 0),
('(아이) 꿈하나 적금', 'FIX', '3.75', NULL, '공과금, 카드대금 이체 등 각종 주거래 건수에 따라 우대금리가 제공되는 월복리 적금!', 1, '만기일전에 중도해지 시 약정한 금리보다 낮은 중도해지금리가 적용됩니다.\n청약우대는 가입일 (또는 재예치일) 이전 또는 당일에 보유시 적용됩니다.\n동일기관, 학교 등 단체신규 10인 이상의 금리는 동일 영업점에서 확인하고 신규하는 경우 적용됩니다.\n만 19세까지만 만기 자동재예치되며 희망대학 입학 축하금리는 만14세까지만 등록가능하며, 입학통지서 등 증빙자료를 KEB하나은행 영업점으로 제출하셔야 합니다.', '이 예금은 예금자보호법에 따라 원금과 소정의 이자를 합하여 1인당 "5천만원까지"(하나은행의 여타 보호 상품과 합산) 보호됩니다.', '가입대상 : 만 18세 이하 실명의 개인 (1인 1계좌), 가입금액 : 1천원 이상 150만원 이하, 이자지급방법 : 만기일시지급식 : 만기(후)해지시 이자를 지급', 0),
('트래블로그 여행 적금', 'FIX', '3.20', NULL, '트래블로그 카드 사용 실적으로 우대금리를 제공하는 하나원큐(비대면)전용 상품', 2, '이 예금의 우대항목중 『트래블로그 카드 사용실적』의 경우, 이 예금 가입일로부터 만기 전전일까지 트래블로그(신용 및 체크)카드 승인시점에 결제(충전)계좌가 하나은행으로 등록되어 있고, 사용(승인)실적이 10회 이상 보유한 경우에 우대금리를 제공합니다.', '이 예금은 예금자보호법에 따라 원금과 소정의 이자를 합하여 1인당 "5천만원까지"(하나은행의 여타 보호 상품과 합산) 보호됩니다.', '가입대상 : 만 14세 이상 실명의 개인 및 개인사업자 (1인 1계좌), 가입금액 : 1만원 이상 ~ 50만원 이하, 이자지급방법 : 만기일시지급식 : 만기(후)해지시 이자를 지급', 0),
('부자씨 적금', 'FIX', '3.30', NULL, '하나원큐 로그인 횟수 & 하나 합 서비스 등록에 따라 우대금리 받고, 적금 모아서 예금으로~ 예금이 모여서 목돈을 제공하는 상품', 2, '재예치시에는 1년 단위로 만기일(단, 휴일인 경우 익영업일)에 재예치 하며, 재예치된 (세후)원리금은 재예치일의 ‘하나의 정기예금‘ 1년제 적용금리가, 재예치이후 적립금은 재예치일의 ‘부자씨 적금’의 기본금리와 우대금리 가 적용됩니다.\n(※‘하나의 정기예금_1년제’ 적용금리는 영업점 및 인터넷 홈페이지 하나원큐(스마트폰뱅킹)에 고시합니다.)\n일부해지는 재예치된 (세후)원리금에 한해 만기일 이전 2회까지 가능하며, 일부해지후 예금잔액은 계약기간내 적립금 이상을 유지하여야 합니다.', '이 예금은 예금자보호법에 따라 원금과 소정의 이자를 합하여 1인당 "5천만원까지"(하나은행의 여타 보호 상품과 합산) 보호됩니다.', '가입대상 : 실명의 개인 및 개인사업자 (1인 1계좌), 가입금액 : 1원 이상 ~ 50만원 이하, 이자지급방법 : 만기일시지급식 : 만기(후)해지시 이자를 지급', 0),
('하나 타이밍 적금', 'FIX', '3.05', NULL, '지금은 저축할 타이밍! 게임하듯 재밌게 타이밍 버튼을 터치하여 저축시 우대금리가 제공 되는 상품', 2, '만기일 전에 중도해지 시 약정한 금리보다 낮은 중도해지금리가 적용됩니다. 우대금리는 만기 해지 시 제공하며, 일부 해지 및 중도해지 시에는 제공하지 않습니다.', '이 예금은 예금자보호법에 따라 원금과 소정의 이자를 합하여 1인당 "5천만원까지"(하나은행의 여타 보호 상품과 합산) 보호됩니다.', '가입대상 : 실명의 개인 및 개인사업자 (1인 1계좌), 가입금액 : 1천원 이상 50만원 이하, 이자지급방법 : 만기일시지급식 : 만기(후)해지시 이자를 지급', 0),
('희망저축계좌I', 'FIX', '3.50', NULL, '보건복지부 『자산형성지원 통장사업 (운영지침)』에서 정한 대상자가 자산을 형성할 수 있도록 적립금 납입시 정부지원금을 지원하는 적립식 상품', 3, '정부지원금에 관한 세부내용(지원조건, 지원금액, 지급방법 등)은 보건복지부 『자산형성지원 통장사업 (운영지침)』에서 정하는 바에 따릅니다. 정부지원금은 신규시 지정한 지원금 수령계좌로 입금됩니다. 계좌의 해지는 지방자치단체 (‘운영지침’에서 명시한 기관)등에 사전 신청 후, 은행 앞 해지 승인이 통지된 경우에만 가능 합니다.', '이 예금은 예금자보호법에 따라 원금과 소정의 이자를 합하여 1인당 "5천만원까지"(하나은행의 여타 보호 상품과 합산) 보호됩니다.', '가입대상 : "운영지침"에 따라 지방자치단체가 은행에 가입 승인을 통지한 실명의 개인, 가입금액 : 10만원 이상 ~ 50만원 이하, 이자지급방법 : 만기일시지급식 : 만기(후)해지시 이자를 지급', 0),
('손님케어 적금', 'FIX', '4.50', NULL, '하나은행 고객센터를 통하여 가입하는 손님케어센터 전용 적금', 1, '이 적금 가입은 하나은행 고객센터에서만 가능합니다. 마케팅 동의 우대금리는 마케팅 미동의 손님일 경우 가입 후 익월말까지 동의하셔야 우대금리 적용이 가능합니다.', '이 예금은 예금자보호법에 따라 원금과 소정의 이자를 합하여 1인당 "5천만원까지"(하나은행의 여타 보호 상품과 합산) 보호됩니다.', '가입대상 : 실명의 개인 또는 개인사업자 (1인 1계좌), 가입금액 : 1천원 이상 ~ 20만원 이하, 이자지급방법 : 만기일시지급식 : 만기(후)해지시 이자를 지급', 0),
('자유적금', 'FIX', '2.85', NULL, '계약기간 동안 수시로 적립할 수 있는 자유적립식 상품', 5,  '만기일 전에 중도해지 시 약정한 금리보다 낮은 중도해지금리가 적용됩니다.', '이 예금은 예금자보호법에 따라 원금과 소정의 이자를 합하여 1인당 "5천만원까지"(하나은행의 여타 보호 상품과 합산) 보호됩니다.', '가입대상 : 제한없음, 가입금액 : 1천원 이상 1억원 이하, 이자지급방법 : 만기일시지급식 : 만기(후)해지시 이자를 지급', 0),
('청년 주택드림 청약통장', 'FIX', '4.50', NULL, '청년들의 목돈마련과 내 집 마련을, 청년 주택드림 청약통장으로 시작하세요~', 10,  '만기일 전에 중도해지 시 약정한 금리보다 낮은 중도해지금리가 적용됩니다.', '이 예금은 예금자보호법에 따라 원금과 소정의 이자를 합하여 1인당 "5천만원까지"(하나은행의 여타 보호 상품과 합산) 보호됩니다.', '가입대상 : 만 19세 ~ 만 34세 이하의 무주택 거주자로서 다음 1), 2) 중 어느 하나에 해당하는 자 1) 연소득 5천만원 이하 신고소득(근로,사업,기타) 이 있는 자 2) 직전 과세기간(직전 과세기간의 소득서류가 확정되지 않은 기간에 가입하는 경우 전전년도 포함), 가입금액 : 2만원부터 100만원 이하, 이자지급방법 : 만기일시지급식 : 만기(후)해지시 이자를 지급', 0),
('상호부금', 'FIX', '2.50', NULL, '정액적립방식 또는 자유적립방식을 선택하여 적립하고 만기에 목돈을 마련하는 상품', 3,  '기존 가입고객에 대한 적용 여부 : 적용\n변경 전 : 만기일 전에 중도해지시 약정한 금리보다 낮은 중도해지금리가 적용됩니다.\n변경 후 : 삭제', '이 예금은 예금자보호법에 따라 원금과 소정의 이자를 합하여 1인당 "5천만원까지"(하나은행의 여타 보호 상품과 합산) 보호됩니다.', '가입대상 : 제한없음, 가입금액 : 1천원 이상, 이자지급방법 : 만기일시지급식 : 만기(후)해지시 이자를 지급', 0),
('청년내일저축계좌','FIX', '4.00', NULL, '보건복지부 『자산형성지원 통장사업(운영지침)』에서 정한 대상자가 자산을 형성할 수 있도록 적립금 납입시 정부지원금을 지원하는 적립식 상품', 3,  '정부지원금에 관한 세부내용(지원조건, 지원금액, 지급방법 등)은 보건복지부 『자산형성지원 통장사업 (운영지침)』에서 정하는 바에 따릅니다.\n정부지원금은 신규시 지정한 지원금 수령계좌로 입금됩니다.\n계좌의 해지는 지방자치단체 (‘운영지침’에서 명시한 기관)등에 사전 신청 후, 은행 앞 해지 승인이 통지된 경우에만 가능 합니다.\n적립 한도는 당월 적립 인정기간 內에 최소 10만원이상 최대 50만원이내입니다.', '이 예금은 예금자보호법에 따라 원금과 소정의 이자를 합하여 1인당 "5천만원까지"(하나은행의 여타 보호 상품과 합산) 보호됩니다.', '가입대상 : “운영지침”에 따라 지방자치단체가 은행에 가입 승인을 통지한 실명의 개인, 가입금액 : 10만원 이상 ~ 50만원 이상, 이자지급방법 : 만기일시지급식 : 만기(후)해지시 이자를 지급', 0);

INSERT INTO enrolled_products (user_goal_id, product_id, contract_period, initial_amount, auto_debit_amount, auto_debit_day, maturity_date, auto_renewal, deleted_yn, created_at, updated_at) VALUES
(1, 2, 5, 0, 1000000, 25, '20290125', 1, 0, '2024-01-25 09:05:00', '2024-01-25 09:05:00'),
(2, 5, 1, 0, 500000, 25, '20250325', 1, 0, '2024-03-25 09:05:00', '2024-03-25 09:05:00'),
(3, 15, 10, 0, 400000, 25, '20340525', 1, 0, '2024-05-25 09:05:00', '2024-05-25 09:05:00');

INSERT INTO accounts (user_id, enrolled_product_id, account_number, account_type_cd, account_alias, balance, deleted_yn, created_at, updated_at) VALUES
(1, NULL, '17802064565319628', 'CHECKING', '입출금 계좌', 0, 0, '2024-01-12 11:57:10', '2024-05-31 10:01:11'),
(1, NULL, '17802503637822813', 'SALARY', '월급 통장', 0, 0, '2024-01-13 11:57:10', '2024-05-25 09:10:00'),
(1, NULL, '17808988033522840', 'LIFE', '생활비', 636000, 0, '2024-01-15 11:57:10', '2024-06-03 10:01:11'),
(1, NULL, '17808239899294674', 'SAVING', '저축비', 1500000, 0, '2024-01-15 11:57:10', '2024-06-03 10:01:11'),
(1, NULL, '17805665787659274', 'SPARE', '여비비', 2100000, 0, '2024-01-15 11:57:10', '2024-06-03 10:01:11'),
(1, NULL, '17805334531995779', 'PARKING', '파킹 계좌', 0, 0, '2024-01-12 11:57:10', '2024-06-03 10:01:11'),
(1, 1, '17803490874640169', 'INSTALLMENT_SAVING', '청년도약계좌 적금 계좌', 4046050, 0, '2024-01-25 09:00:00', '2024-05-25 09:00:00'),
(1, 2, '17803490874640170', 'INSTALLMENT_SAVING', '내(맘) 적금 계좌', 1504692, 0, '2024-03-25 09:00:00', '2024-05-25 09:00:00'),
(1, 3, '17803490874640171', 'INSTALLMENT_SAVING', '청년 주택드림 청약통장 계좌', 400000, 0, '2024-05-25 09:00:00', '2024-05-25 09:00:00');

INSERT INTO account_transactions (account_id, account_payment_type_cd, account_transaction_type_cd, amount, old_balance, new_balance, target_nm, description, deleted_yn, created_at, updated_at)
VALUES
(2, 'TRANSFER', 'TRANSFER', 3000000, 0, 3000000, '1월 급여', NULL, 0, '2024-01-25 09:00:00', '2024-01-25 09:00:00'),
(2, 'TRANSFER', 'TRANSFER', -1500000, 3000000, 1500000, '저축 계좌 이체', NULL, 0, '2024-01-25 09:00:01', '2024-01-25 09:00:01'),
(4, 'TRANSFER', 'TRANSFER', 1500000, 0, 1500000, '저축 계좌 이체', NULL, 0, '2024-01-25 09:00:01', '2024-01-25 09:00:01'),
(2, 'TRANSFER', 'TRANSFER', -900000, 1500000, 600000, '생활비 계좌 이체', NULL, 0, '2024-01-25 09:00:01', '2024-01-25 09:00:01'),
(3, 'TRANSFER', 'TRANSFER', 900000, 0, 900000, '생활비 계좌 이체', NULL, 0, '2024-01-25 09:00:01', '2024-01-25 09:00:01'),
(2, 'TRANSFER', 'TRANSFER', -600000, 600000, 0, '여비 계좌 이체', NULL, 0, '2024-01-25 09:00:01', '2024-01-25 09:00:01'),
(5, 'TRANSFER', 'TRANSFER', 600000, 0, 600000, '여비 계좌 이체', NULL, 0, '2024-01-25 09:00:01', '2024-01-25 09:00:01'),

-- 1월 25일 목표(첫차 구매) 추가 및 적금 상품 가입(청년 도약 계좌)
(4, 'TRANSFER', 'TRANSFER', -1000000, 1500000, 500000, '하나 청년도약계좌 적금 이체', NULL, 0, '2024-01-25 09:00:05', '2024-01-25 09:00:05'),
(7, 'TRANSFER', 'TRANSFER', 1000000, 0, 1000000, '하나 청년도약계좌 적금 이체', NULL, 0, '2024-01-25 09:00:05', '2024-01-25 09:00:05'),

-- January 25, 2024
(3, 'CARD', 'FOOD', -3000, 900000, 897000, '메가커피', NULL, 0, '2024-01-25 09:40:00', '2024-01-25 09:40:00'),
(3, 'CARD', 'FOOD', -12000, 897000, 885000, '행운식당', NULL, 0, '2024-01-25 11:50:00', '2024-01-25 11:50:00'),
(3, 'CARD', 'SHOPPING', -150000, 885000, 735000, 'EMPTY 성수', NULL, 0, '2024-01-25 18:12:00', '2024-01-25 18:12:00'),

-- January 26, 2024
(3, 'CARD', 'FOOD', -5000, 735000, 730000, '스타벅스', NULL, 0, '2024-01-26 09:40:00', '2024-01-26 09:40:00'),
(3, 'CARD', 'FOOD', -8000, 730000, 722000, '김밥천국', NULL, 0, '2024-01-26 12:00:00', '2024-01-26 12:00:00'),
(3, 'CARD', 'SHOPPING', -120000, 722000, 602000, 'ABC마트', NULL, 0, '2024-01-26 16:30:00', '2024-01-26 16:30:00'),

-- January 27, 2024
(3, 'CARD', 'FOOD', -4000, 602000, 598000, '메가커피', NULL, 0, '2024-01-27 09:40:00', '2024-01-27 09:40:00'),
(3, 'CARD', 'FOOD', -9000, 598000, 589000, '파리바게뜨', NULL, 0, '2024-01-27 12:00:00', '2024-01-27 12:00:00'),

-- January 28, 2024
(3, 'CARD', 'FOOD', -6000, 589000, 583000, '스타벅스', NULL, 0, '2024-01-28 09:40:00', '2024-01-28 09:40:00'),
(3, 'CARD', 'LEISURE', -70000, 583000, 513000, '오렌지포차 압구정', NULL, 0, '2024-01-28 16:30:00', '2024-01-28 16:30:00'),

-- January 29, 2024
(3, 'CARD', 'FOOD', -5000, 513000, 508000, '스타벅스', NULL, 0, '2024-01-29 09:40:00', '2024-01-29 09:40:00'),
(3, 'CARD', 'FOOD', -6000, 508000, 502000, '맘스터치', NULL, 0, '2024-01-29 12:00:00', '2024-01-29 12:00:00'),

-- January 30, 2024
(3, 'CARD', 'FOOD', -7000, 502000, 495000, '어니언 성수', NULL, 0, '2024-01-30 09:40:00', '2024-01-30 09:40:00'),
(3, 'CARD', 'SHOPPING', -50000, 495000, 445000, 'EQL 성수', NULL, 0, '2024-01-30 16:30:00', '2024-01-30 16:30:00'),

-- January 31, 2024
(3, 'CARD', 'FOOD', -4000, 445000, 441000, '스타벅스', NULL, 0, '2024-01-31 09:40:00', '2024-01-31 09:40:00'),

-- February 1, 2024
(3, 'CARD', 'FOOD', -5000, 441000, 436000, '투썸플레이스', NULL, 0, '2024-02-01 09:40:00', '2024-02-01 09:40:00'),
(3, 'CARD', 'FOOD', -8000, 436000, 428000, '죠스떡볶이', NULL, 0, '2024-02-01 12:00:00', '2024-02-01 12:00:00'),

-- February 2, 2024
(3, 'CARD', 'FOOD', -6000, 428000, 422000, '앤젤리너스', NULL, 0, '2024-02-02 09:40:00', '2024-02-02 09:40:00'),
(3, 'CARD', 'LEISURE', -80000, 422000, 342000, '롯데월드', NULL, 0, '2024-02-02 18:00:00', '2024-02-02 18:00:00'),

-- February 3, 2024
(3, 'CARD', 'FOOD', -5000, 342000, 337000, '폴 바셋', NULL, 0, '2024-02-03 09:40:00', '2024-02-03 09:40:00'),
(3, 'CARD', 'FOOD', -7000, 337000, 330000, '던킨도너츠', NULL, 0, '2024-02-03 12:00:00', '2024-02-03 12:00:00'),

-- February 4, 2024
(3, 'CARD', 'FOOD', -4000, 330000, 326000, '카페베네', NULL, 0, '2024-02-04 09:40:00', '2024-02-04 09:40:00'),

-- February 5, 2024
(3, 'CARD', 'FOOD', -6000, 326000, 320000, '탐앤탐스', NULL, 0, '2024-02-05 09:40:00', '2024-02-05 09:40:00'),
(3, 'CARD', 'FOOD', -9000, 320000, 311000, '파리바게뜨', NULL, 0, '2024-02-05 12:00:00', '2024-02-05 12:00:00'),

-- February 6, 2024
(3, 'CARD', 'FOOD', -5000, 311000, 306000, '할리스커피', NULL, 0, '2024-02-06 09:40:00', '2024-02-06 09:40:00'),
(3, 'CARD', 'FOOD', -8000, 306000, 298000, '김밥천국', NULL, 0, '2024-02-06 12:00:00', '2024-02-06 12:00:00'),

-- February 7, 2024
(3, 'CARD', 'FOOD', -7000, 298000, 291000, '스타벅스', NULL, 0, '2024-02-07 09:40:00', '2024-02-07 09:40:00'),

-- February 8, 2024
(3, 'CARD', 'FOOD', -6000, 291000, 285000, '커피빈', NULL, 0, '2024-02-08 09:40:00', '2024-02-08 09:40:00'),

-- February 9, 2024
(3, 'CARD', 'FOOD', -7000, 285000, 278000, '폴 바셋', NULL, 0, '2024-02-09 09:40:00', '2024-02-09 09:40:00'),

-- February 10, 2024
(3, 'CARD', 'FOOD', -5000, 278000, 273000, '탐앤탐스', NULL, 0, '2024-02-10 09:40:00', '2024-02-10 09:40:00'),

-- February 11, 2024
(3, 'CARD', 'FOOD', -8000, 273000, 265000, '김밥천국', NULL, 0, '2024-02-11 12:00:00', '2024-02-11 12:00:00'),

-- February 12, 2024
(3, 'CARD', 'FOOD', -6000, 265000, 259000, '할리스커피', NULL, 0, '2024-02-12 09:40:00', '2024-02-12 09:40:00'),

-- February 13, 2024
(3, 'CARD', 'TRANSPORT', -62000, 259000, 197000, '서울 교통', NULL, 0, '2024-02-13 10:00:00', '2024-02-13 10:00:00'),

-- February 14, 2024
(3, 'CARD', 'FOOD', -7000, 197000, 190000, '스타벅스', NULL, 0, '2024-02-14 09:40:00', '2024-02-14 09:40:00'),

-- February 15, 2024
(3, 'CARD', 'FOOD', -5000, 190000, 185000, '커피빈', NULL, 0, '2024-02-15 09:40:00', '2024-02-15 09:40:00'),

-- February 16, 2024
(3, 'CARD', 'FOOD', -9000, 185000, 176000, '파리바게뜨', NULL, 0, '2024-02-16 09:40:00', '2024-02-16 09:40:00'),

-- February 17, 2024
(3, 'CARD', 'FOOD', -5000, 176000, 171000, '할리스커피', NULL, 0, '2024-02-17 09:40:00', '2024-02-17 09:40:00'),

-- February 18, 2024
(3, 'CARD', 'FOOD', -7000, 171000, 164000, '폴 바셋', NULL, 0, '2024-02-18 09:40:00', '2024-02-18 09:40:00'),

-- February 19, 2024
(3, 'CARD', 'FOOD', -6000, 164000, 158000, '탐앤탐스', NULL, 0, '2024-02-19 09:40:00', '2024-02-19 09:40:00'),

-- February 20, 2024
(3, 'CARD', 'FOOD', -8000, 158000, 150000, '김밥천국', NULL, 0, '2024-02-20 12:00:00', '2024-02-20 12:00:00'),

-- February 21, 2024
(3, 'CARD', 'FOOD', -5000, 150000, 145000, '카페베네', NULL, 0, '2024-02-21 09:40:00', '2024-02-21 09:40:00'),

-- February 22, 2024
(3, 'CARD', 'FOOD', -6000, 145000, 139000, '앤젤리너스', NULL, 0, '2024-02-22 09:40:00', '2024-02-22 09:40:00'),

-- February 23, 2024
(3, 'CARD', 'FOOD', -7000, 139000, 132000, '스타벅스', NULL, 0, '2024-02-23 09:40:00', '2024-02-23 09:40:00'),

-- February 24, 2024
(3, 'CARD', 'FOOD', -5000, 132000, 127000, '커피빈', NULL, 0, '2024-02-24 09:40:00', '2024-02-24 09:40:00'),

-- February 25, 2024
(2, 'TRANSFER', 'TRANSFER', 3000000, 0, 3000000, '2월 급여', NULL, 0, '2024-02-25 09:00:00', '2024-02-25 09:00:00'),
(2, 'TRANSFER', 'TRANSFER', -1500000, 3000000, 1500000, '통장쪼개기 저축 계좌 출금', NULL, 0, '2024-02-25 09:00:01', '2024-02-25 09:00:01'),
(4, 'TRANSFER', 'TRANSFER', 1500000, 500000, 2000000, '통장쪼개기 저축 계좌 입금', NULL, 0, '2024-02-25 09:00:01', '2024-02-25 09:00:01'),
(2, 'TRANSFER', 'TRANSFER', -900000, 1500000, 600000, '통장쪼개기 생활비 계좌 출금', NULL, 0, '2024-02-25 09:00:01', '2024-02-25 09:00:01'),
(3, 'TRANSFER', 'TRANSFER', 900000, 127000, 1027000, '통장쪼개기 생활비 계좌 입금', NULL, 0, '2024-02-25 09:00:01', '2024-02-25 09:00:01'),
(2, 'TRANSFER', 'TRANSFER', -600000, 600000, 0, '통장쪼개기 여비 계좌 출금', NULL, 0, '2024-02-25 09:00:01', '2024-02-25 09:00:01'),
(5, 'TRANSFER', 'TRANSFER', 600000, 600000, 1200000, '통장쪼개기 여비 계좌 입금', NULL, 0, '2024-02-25 09:00:01', '2024-02-25 09:00:01'),

(7, 'TRANSFER', 'INTEREST', 4583, 1000000, 1004583, '하나 청년도약계좌 적금 이자', NULL, 0, '2024-02-25 09:05:00', '2024-02-25 09:05:00'),
(4, 'TRANSFER', 'TRANSFER', -1000000, 2000000, 1000000, '하나 청년도약계좌 적금 출금', NULL, 0, '2024-02-25 09:10:05', '2024-02-25 09:10:05'),
(7, 'TRANSFER', 'TRANSFER', 1000000, 1004583, 2004583, '하나 청년도약계좌 적금 이체', NULL, 0, '2024-02-25 09:10:05', '2024-02-25 09:10:05'),

(3, 'CARD', 'FOOD', -3000, 1027000, 1024000, '메가커피', NULL, 0, '2024-02-25 09:40:00', '2024-02-25 09:40:00'),
(3, 'CARD', 'FOOD', -8000, 1024000, 1016000, '김밥천국', NULL, 0, '2024-02-25 12:00:00', '2024-02-25 12:00:00'),
(3, 'CARD', 'SHOPPING', -120000, 1016000, 896000, 'ABC마트', NULL, 0, '2024-02-25 16:30:00', '2024-02-25 16:30:00'),

-- February 26, 2024
(3, 'CARD', 'FOOD', -6000, 896000, 890000, '투썸플레이스', NULL, 0, '2024-02-26 09:40:00', '2024-02-26 09:40:00'),
(3, 'CARD', 'LEISURE', -70000, 890000, 820000, 'CGV', NULL, 0, '2024-02-26 18:00:00', '2024-02-26 18:00:00'),

-- February 27, 2024
(3, 'CARD', 'FOOD', -5000, 820000, 815000, '스타벅스', NULL, 0, '2024-02-27 09:40:00', '2024-02-27 09:40:00'),
(3, 'CARD', 'FOOD', -7000, 815000, 808000, '행운식당', NULL, 0, '2024-02-27 12:00:00', '2024-02-27 12:00:00'),

-- February 28, 2024
(3, 'CARD', 'FOOD', -6000, 808000, 802000, '스타벅스', NULL, 0, '2024-02-28 09:40:00', '2024-02-28 09:40:00'),

-- February 29, 2024 (Leap year day)
(3, 'CARD', 'FOOD', -9000, 802000, 793000, '파리바게뜨', NULL, 0, '2024-02-29 09:40:00', '2024-02-29 09:40:00'),

-- March 1, 2024
(3, 'CARD', 'FOOD', -5000, 793000, 788000, '스타벅스', NULL, 0, '2024-03-01 09:40:00', '2024-03-01 09:40:00'),
(3, 'CARD', 'FOOD', -7000, 788000, 781000, '맥도날드', NULL, 0, '2024-03-01 12:00:00', '2024-03-01 12:00:00'),

-- March 2, 2024
(3, 'CARD', 'FOOD', -6000, 781000, 775000, '커피빈', NULL, 0, '2024-03-02 09:40:00', '2024-03-02 09:40:00'),

-- March 3, 2024
(3, 'CARD', 'FOOD', -7000, 775000, 768000, '스타벅스', NULL, 0, '2024-03-03 09:40:00', '2024-03-03 09:40:00'),

-- March 4, 2024
(3, 'CARD', 'FOOD', -5000, 768000, 763000, '스타벅스', NULL, 0, '2024-03-04 09:40:00', '2024-03-04 09:40:00'),

-- March 5, 2024
(3, 'CARD', 'FOOD', -8000, 763000, 755000, '김밥천국', NULL, 0, '2024-03-05 09:40:00', '2024-03-05 09:40:00'),

-- March 6, 2024
(3, 'CARD', 'FOOD', -6000, 755000, 749000, '파리바게뜨', NULL, 0, '2024-03-06 09:40:00', '2024-03-06 09:40:00'),

-- March 7, 2024
(3, 'CARD', 'FOOD', -7000, 749000, 742000, '스타벅스', NULL, 0, '2024-03-07 09:40:00', '2024-03-07 09:40:00'),

-- March 8, 2024
(3, 'CARD', 'FOOD', -5000, 742000, 737000, '스타벅스', NULL, 0, '2024-03-08 09:40:00', '2024-03-08 09:40:00'),

-- March 9, 2024
(3, 'CARD', 'FOOD', -6000, 737000, 731000, '스타벅스', NULL, 0, '2024-03-09 09:40:00', '2024-03-09 09:40:00'),

-- March 10, 2024
(3, 'CARD', 'FOOD', -9000, 731000, 722000, '김밥천국', NULL, 0, '2024-03-10 09:40:00', '2024-03-10 09:40:00'),

-- March 11, 2024
(3, 'CARD', 'FOOD', -5000, 722000, 717000, '파리바게뜨', NULL, 0, '2024-03-11 09:40:00', '2024-03-11 09:40:00'),

-- March 12, 2024
(3, 'CARD', 'FOOD', -8000, 717000, 709000, '폴 바셋', NULL, 0, '2024-03-12 09:40:00', '2024-03-12 09:40:00'),

-- March 13, 2024
(3, 'CARD', 'TRANSPORT', -65000, 709000, 644000, '서울 교통', NULL, 0, '2024-03-13 10:00:00', '2024-03-13 10:00:00'),

-- March 14, 2024
(3, 'CARD', 'FOOD', -7000, 644000, 637000, '스타벅스', NULL, 0, '2024-03-14 09:40:00', '2024-03-14 09:40:00'),

-- March 15, 2024
(3, 'CARD', 'FOOD', -5000, 637000, 632000, '서브웨이', NULL, 0, '2024-03-15 09:40:00', '2024-03-15 09:40:00'),

-- March 16, 2024
(3, 'CARD', 'FOOD', -9000, 632000, 623000, '파리바게뜨', NULL, 0, '2024-03-16 09:40:00', '2024-03-16 09:40:00'),

-- March 17, 2024
(3, 'CARD', 'FOOD', -5000, 623000, 618000, '메가커피', NULL, 0, '2024-03-17 09:40:00', '2024-03-17 09:40:00'),

-- March 18, 2024
(3, 'CARD', 'FOOD', -7000, 618000, 611000, '스타벅스', NULL, 0, '2024-03-18 09:40:00', '2024-03-18 09:40:00'),

-- March 19, 2024
(3, 'CARD', 'FOOD', -6000, 611000, 605000, '탐앤탐스', NULL, 0, '2024-03-19 09:40:00', '2024-03-19 09:40:00'),

-- March 20, 2024
(3, 'CARD', 'FOOD', -8000, 605000, 597000, '르프리크 성수', NULL, 0, '2024-03-20 12:00:00', '2024-03-20 12:00:00'),

-- March 21, 2024
(3, 'CARD', 'FOOD', -5000, 597000, 592000, '카페베네', NULL, 0, '2024-03-21 09:40:00', '2024-03-21 09:40:00'),

-- March 22, 2024
(3, 'CARD', 'FOOD', -6000, 592000, 586000, '앤젤리너스', NULL, 0, '2024-03-22 09:40:00', '2024-03-22 09:40:00'),

-- March 23, 2024
(3, 'CARD', 'FOOD', -7000, 586000, 579000, '스타벅스', NULL, 0, '2024-03-23 09:40:00', '2024-03-23 09:40:00'),

-- March 24, 2024
(3, 'CARD', 'FOOD', -5000, 579000, 574000, '커피빈', NULL, 0, '2024-03-24 09:40:00', '2024-03-24 09:40:00'),
(3, 'CARD', 'SHOPPING', -270000, 574000, 304000, '옵스큐라 성수', NULL, 0, '2024-03-24 18:00:00', '2024-03-24 18:00:00'),
(3, 'CARD', 'LEISURE', -60000, 304000, 244000, '유니온스타 볼링 성수', NULL, 0, '2024-03-24 21:00:00', '2024-03-24 21:00:00'),

-- March 25, 2024 (Next salary payment) 통장 쪼개기 비율 6:3:1
(2, 'TRANSFER', 'TRANSFER', 3000000, 0, 3000000, '3월 급여', NULL, 0, '2024-03-25 09:00:00', '2024-03-25 09:00:00'),
(2, 'TRANSFER', 'TRANSFER', -1800000, 3000000, 1200000, '통장쪼개기 저축 계좌 출금', NULL, 0, '2024-03-25 09:00:01', '2024-03-25 09:00:01'),
(4, 'TRANSFER', 'TRANSFER', 1800000, 1000000, 2800000, '통장쪼개기 저축 계좌 입금', NULL, 0, '2024-03-25 09:00:01', '2024-03-25 09:00:01'),
(2, 'TRANSFER', 'TRANSFER', -900000, 1200000, 300000, '통장쪼개기 생활비 계좌 출금', NULL, 0, '2024-03-25 09:00:01', '2024-03-25 09:00:01'),
(3, 'TRANSFER', 'TRANSFER', 900000, 244000, 1144000, '통장쪼개기 생활비 계좌 입금', NULL, 0, '2024-03-25 09:00:01', '2024-03-25 09:00:01'),
(2, 'TRANSFER', 'TRANSFER', -300000, 300000, 0, '통장쪼개기 여비 계좌 출금', NULL, 0, '2024-03-25 09:00:01', '2024-03-25 09:00:01'),
(5, 'TRANSFER', 'TRANSFER', 300000, 1200000, 1500000, '통장쪼개기 여비 계좌 입금', NULL, 0, '2024-03-25 09:00:01', '2024-03-25 09:00:01'),

(7, 'TRANSFER', 'INTEREST', 9183, 2004583, 2013766, '하나 청년도약계좌 적금 이자', NULL, 0, '2024-03-25 09:05:00', '2024-03-25 09:05:00'),
(4, 'TRANSFER', 'TRANSFER', -1000000, 2800000, 1800000, '하나 청년도약계좌 적금 출금', NULL, 0, '2024-03-25 09:10:05', '2024-03-25 09:10:05'),
(7, 'TRANSFER', 'TRANSFER', 1000000, 2013766, 3013766, '하나 청년도약계좌 적금 입금', NULL, 0, '2024-03-25 09:10:05', '2024-03-25 09:10:05'),

-- 3월 25일부터 목표 추가(WISH: 내년 여름 해외여행) + 적금((내맘) 적금) 추가
(4, 'TRANSFER', 'TRANSFER', -500000, 1800000, 1300000, '(내맘) 적금 출금', NULL, 0, '2024-03-25 09:10:05', '2024-03-25 09:10:05'),
(8, 'TRANSFER', 'TRANSFER', 500000, 0, 500000, '(내맘) 적금 입금', NULL, 0, '2024-03-25 09:10:05', '2024-03-25 09:10:05'),

(3, 'CARD', 'FOOD', -4000, 1144000, 1140000, '메가커피', NULL, 0, '2024-03-25 09:40:00', '2024-03-25 09:40:00'),
(3, 'CARD', 'SHOPPING', -50000, 1140000, 1090000, 'ABC마트', NULL, 0, '2024-03-25 12:00:00', '2024-03-25 12:00:00'),

-- March 26, 2024
(3, 'CARD', 'FOOD', -6000, 1090000, 1084000, '스타벅스', NULL, 0, '2024-03-26 09:40:00', '2024-03-26 09:40:00'),
(3, 'CARD', 'LEISURE', -70000, 1084000, 1014000, 'CGV', NULL, 0, '2024-03-26 18:00:00', '2024-03-26 18:00:00'),

-- March 27, 2024
(3, 'CARD', 'FOOD', -5000, 1014000, 1009000, '스타벅스', NULL, 0, '2024-03-27 09:40:00', '2024-03-27 09:40:00'),

-- March 28, 2024
(3, 'CARD', 'SHOPPING', -90000, 1009000, 919000, '롯데마트', NULL, 0, '2024-03-28 10:00:00', '2024-03-28 10:00:00'),

-- March 29, 2024
(3, 'CARD', 'FOOD', -7000, 919000, 912000, '김밥천국', NULL, 0, '2024-03-29 09:40:00', '2024-03-29 09:40:00'),

-- March 30, 2024
(3, 'CARD', 'FOOD', -6000, 912000, 906000, '스타벅스', NULL, 0, '2024-03-30 09:40:00', '2024-03-30 09:40:00'),

-- March 31, 2024
(3, 'CARD', 'LEISURE', -80000, 906000, 826000, '롯데월드', NULL, 0, '2024-03-31 18:00:00', '2024-03-31 18:00:00'),

-- April 1, 2024
(3, 'CARD', 'FOOD', -5000, 826000, 821000, '맥도날드', NULL, 0, '2024-04-01 09:40:00', '2024-04-01 09:40:00'),
(3, 'CARD', 'FOOD', -7000, 821000, 814000, '서브웨이', NULL, 0, '2024-04-01 12:00:00', '2024-04-01 12:00:00'),

-- April 2, 2024
(3, 'CARD', 'SHOPPING', -30000, 814000, 784000, '이마트', NULL, 0, '2024-04-02 10:00:00', '2024-04-02 10:00:00'),

-- April 3, 2024
(3, 'CARD', 'FOOD', -5000, 784000, 779000, '파리바게뜨', NULL, 0, '2024-04-03 09:40:00', '2024-04-03 09:40:00'),

-- April 4, 2024
(3, 'CARD', 'LEISURE', -60000, 779000, 719000, '볼링장', NULL, 0, '2024-04-04 18:00:00', '2024-04-04 18:00:00'),

-- April 5, 2024
(3, 'CARD', 'FOOD', -7000, 719000, 712000, '스타벅스', NULL, 0, '2024-04-05 09:40:00', '2024-04-05 09:40:00'),

-- April 6, 2024
(3, 'CARD', 'FOOD', -6000, 712000, 706000, '커피빈', NULL, 0, '2024-04-06 09:40:00', '2024-04-06 09:40:00'),

-- April 7, 2024
(3, 'CARD', 'FOOD', -8000, 706000, 698000, '김밥천국', NULL, 0, '2024-04-07 09:40:00', '2024-04-07 09:40:00'),

-- April 8, 2024
(3, 'CARD', 'SHOPPING', -100000, 698000, 598000, 'ABC마트', NULL, 0, '2024-04-08 10:00:00', '2024-04-08 10:00:00'),

-- April 9, 2024
(3, 'CARD', 'FOOD', -5000, 598000, 593000, '파리바게뜨', NULL, 0, '2024-04-09 09:40:00', '2024-04-09 09:40:00'),

-- April 10, 2024
(3, 'CARD', 'LEISURE', -70000, 593000, 523000, '영화관', NULL, 0, '2024-04-10 18:00:00', '2024-04-10 18:00:00'),

-- April 11, 2024
(3, 'CARD', 'FOOD', -6000, 523000, 517000, '스타벅스', NULL, 0, '2024-04-11 09:40:00', '2024-04-11 09:40:00'),

-- April 12, 2024
(3, 'CARD', 'FOOD', -8000, 517000, 509000, '김밥천국', NULL, 0, '2024-04-12 09:40:00', '2024-04-12 09:40:00'),

-- April 13, 2024
(3, 'CARD', 'TRANSPORT', -65000, 509000, 444000, '서울 교통', NULL, 0, '2024-04-13 10:00:00', '2024-04-13 10:00:00'),

-- April 14, 2024
(3, 'CARD', 'FOOD', -5000, 444000, 439000, '서브웨이', NULL, 0, '2024-04-14 09:40:00', '2024-04-14 09:40:00'),

-- April 15, 2024
(3, 'CARD', 'FOOD', -7000, 439000, 432000, '스타벅스', NULL, 0, '2024-04-15 09:40:00', '2024-04-15 09:40:00'),

-- April 16, 2024
(3, 'CARD', 'LEISURE', -60000, 432000, 372000, '노래방', NULL, 0, '2024-04-16 18:00:00', '2024-04-16 18:00:00'),

-- April 17, 2024
(3, 'CARD', 'FOOD', -5000, 372000, 367000, '파리바게뜨', NULL, 0, '2024-04-17 09:40:00', '2024-04-17 09:40:00'),

-- April 18, 2024
(3, 'CARD', 'FOOD', -7000, 367000, 360000, '스타벅스', NULL, 0, '2024-04-18 09:40:00', '2024-04-18 09:40:00'),

-- April 19, 2024
(3, 'CARD', 'FOOD', -6000, 360000, 354000, '커피빈', NULL, 0, '2024-04-19 09:40:00', '2024-04-19 09:40:00'),

-- April 20, 2024
(3, 'CARD', 'SHOPPING', -40000, 354000, 314000, '이마트', NULL, 0, '2024-04-20 10:00:00', '2024-04-20 10:00:00'),

-- April 21, 2024
(3, 'CARD', 'FOOD', -5000, 314000, 309000, '스타벅스', NULL, 0, '2024-04-21 09:40:00', '2024-04-21 09:40:00'),

-- April 22, 2024
(3, 'CARD', 'LEISURE', -50000, 309000, 259000, '놀이공원', NULL, 0, '2024-04-22 18:00:00', '2024-04-22 18:00:00'),

-- April 23, 2024
(3, 'CARD', 'FOOD', -6000, 259000, 253000, '김밥천국', NULL, 0, '2024-04-23 09:40:00', '2024-04-23 09:40:00'),

-- April 24, 2024
(3, 'CARD', 'FOOD', -5000, 253000, 248000, '스타벅스', NULL, 0, '2024-04-24 09:40:00', '2024-04-24 09:40:00'),
(3, 'CARD', 'SHOPPING', -100000, 248000, 148000, '옵스큐라 성수', NULL, 0, '2024-04-24 12:00:00', '2024-04-24 12:00:00'),
(3, 'CARD', 'LEISURE', -18000, 148000, 130000, '유니온스타 볼링 성수', NULL, 0, '2024-04-24 18:00:00', '2024-04-24 18:00:00'),

-- April 25, 2024 (Next salary payment) 통장 쪼개기 비율 6:3:1
(2, 'TRANSFER', 'TRANSFER', 3000000, 0, 3000000, '4월 급여', NULL, 0, '2024-04-25 09:00:00', '2024-04-25 09:00:00'),
(2, 'TRANSFER', 'TRANSFER', -1800000, 3000000, 1200000, '통장쪼개기 저축 계좌 출금', NULL, 0, '2024-04-25 09:00:01', '2024-04-25 09:00:01'),
(4, 'TRANSFER', 'TRANSFER', 1800000, 1300000, 3100000, '통장쪼개기 저축 계좌 입금', NULL, 0, '2024-04-25 09:00:01', '2024-04-25 09:00:01'),
(2, 'TRANSFER', 'TRANSFER', -900000, 1200000, 300000, '통장쪼개기 생활비 계좌 출금', NULL, 0, '2024-04-25 09:00:01', '2024-04-25 09:00:01'),
(3, 'TRANSFER', 'TRANSFER', 900000, 130000, 1030000, '통장쪼개기 생활비 계좌 입금', NULL, 0, '2024-04-25 09:00:01', '2024-04-25 09:00:01'),
(2, 'TRANSFER', 'TRANSFER', -300000, 300000, 0, '통장쪼개기 여비 계좌 출금', NULL, 0, '2024-04-25 09:00:01', '2024-04-25 09:00:01'),
(5, 'TRANSFER', 'TRANSFER', 300000, 1500000, 1800000, '통장쪼개기 여비 계좌 입금', NULL, 0, '2024-04-25 09:00:01', '2024-04-25 09:00:01'),

(7, 'TRANSFER', 'INTEREST', 13811, 3013766, 3027577, '하나 청년도약계좌 적금 이자', NULL, 0, '2024-04-25 09:05:00', '2024-04-25 09:05:00'),
(4, 'TRANSFER', 'TRANSFER', -1000000, 3100000, 2100000, '하나 청년도약계좌 적금 출금', NULL, 0, '2024-04-25 09:10:05', '2024-04-25 09:10:05'),
(7, 'TRANSFER', 'TRANSFER', 1000000, 3027577, 4027577, '하나 청년도약계좌 적금 입금', NULL, 0, '2024-04-25 09:10:05', '2024-04-25 09:10:05'),

(8, 'TRANSFER', 'INTEREST', 1562, 500000, 501562, '(내맘) 적금 이자', NULL, 0, '2024-04-25 09:10:05', '2024-04-25 09:10:05'),
(4, 'TRANSFER', 'TRANSFER', -500000, 2100000, 1600000, '(내맘) 적금 출금', NULL, 0, '2024-04-25 09:10:05', '2024-04-25 09:10:05'),
(8, 'TRANSFER', 'TRANSFER', 500000, 501562, 1001562, '(내맘) 적금 입금', NULL, 0, '2024-04-25 09:10:05', '2024-04-25 09:10:05'),

(3, 'CARD', 'FOOD', -5000, 1030000, 1025000, '스타벅스', NULL, 0, '2024-04-25 09:40:00', '2024-04-25 09:40:00'),
(3, 'CARD', 'SHOPPING', -70000, 1025000, 955000, '롯데마트', NULL, 0, '2024-04-25 12:00:00', '2024-04-25 12:00:00'),

-- April 26, 2024
(3, 'CARD', 'FOOD', -6000, 955000, 949000, '김밥천국', NULL, 0, '2024-04-26 09:40:00', '2024-04-26 09:40:00'),
(3, 'CARD', 'LEISURE', -80000, 949000, 869000, 'CGV', NULL, 0, '2024-04-26 18:00:00', '2024-04-26 18:00:00'),

-- April 27, 2024
(3, 'CARD', 'FOOD', -5000, 869000, 864000, '스타벅스', NULL, 0, '2024-04-27 09:40:00', '2024-04-27 09:40:00'),

-- April 28, 2024
(3, 'CARD', 'SHOPPING', -90000, 864000, 774000, '이마트', NULL, 0, '2024-04-28 10:00:00', '2024-04-28 10:00:00'),

-- April 29, 2024
(3, 'CARD', 'FOOD', -7000, 774000, 767000, '김밥천국', NULL, 0, '2024-04-29 09:40:00', '2024-04-29 09:40:00'),

-- April 30, 2024
(3, 'CARD', 'FOOD', -6000, 767000, 761000, '스타벅스', NULL, 0, '2024-04-30 09:40:00', '2024-04-30 09:40:00'),

-- May 1, 2024
(3, 'CARD', 'LEISURE', -70000, 761000, 691000, '롯데월드', NULL, 0, '2024-05-01 18:00:00', '2024-05-01 18:00:00'),

-- May 2, 2024
(3, 'CARD', 'FOOD', -5000, 691000, 686000, '맥도날드', NULL, 0, '2024-05-02 09:40:00', '2024-05-02 09:40:00'),
(3, 'CARD', 'FOOD', -7000, 686000, 679000, '서브웨이', NULL, 0, '2024-05-02 12:00:00', '2024-05-02 12:00:00'),

-- May 3, 2024
(3, 'CARD', 'SHOPPING', -30000, 679000, 649000, 'ABC마트', NULL, 0, '2024-05-03 10:00:00', '2024-05-03 10:00:00'),

-- May 4, 2024
(3, 'CARD', 'FOOD', -5000, 649000, 644000, '파리바게뜨', NULL, 0, '2024-05-04 09:40:00', '2024-05-04 09:40:00'),

-- May 5, 2024
(3, 'CARD', 'LEISURE', -60000, 644000, 584000, '볼링장', NULL, 0, '2024-05-05 18:00:00', '2024-05-05 18:00:00'),

-- May 6, 2024
(3, 'CARD', 'FOOD', -7000, 584000, 577000, '스타벅스', NULL, 0, '2024-05-06 09:40:00', '2024-05-06 09:40:00'),

-- May 7, 2024
(3, 'CARD', 'FOOD', -6000, 577000, 571000, '커피빈', NULL, 0, '2024-05-07 09:40:00', '2024-05-07 09:40:00'),

-- May 8, 2024
(3, 'CARD', 'FOOD', -8000, 571000, 563000, '김밥천국', NULL, 0, '2024-05-08 09:40:00', '2024-05-08 09:40:00'),

-- May 9, 2024
(3, 'CARD', 'SHOPPING', -100000, 563000, 463000, '롯데마트', NULL, 0, '2024-05-09 10:00:00', '2024-05-09 10:00:00'),

-- May 10, 2024
(3, 'CARD', 'FOOD', -5000, 463000, 458000, '파리바게뜨', NULL, 0, '2024-05-10 09:40:00', '2024-05-10 09:40:00'),

-- May 11, 2024
(3, 'CARD', 'LEISURE', -70000, 458000, 388000, '영화관', NULL, 0, '2024-05-11 18:00:00', '2024-05-11 18:00:00'),

-- May 12, 2024
(3, 'CARD', 'FOOD', -6000, 388000, 382000, '스타벅스', NULL, 0, '2024-05-12 09:40:00', '2024-05-12 09:40:00'),

-- May 13, 2024
(3, 'CARD', 'TRANSPORT', -68000, 382000, 314000, '서울 교통', NULL, 0, '2024-05-13 10:00:00', '2024-05-13 10:00:00'),

-- May 14, 2024
(3, 'CARD', 'FOOD', -5000, 314000, 309000, '서브웨이', NULL, 0, '2024-05-14 09:40:00', '2024-05-14 09:40:00'),

-- May 15, 2024
(3, 'CARD', 'FOOD', -7000, 309000, 302000, '스타벅스', NULL, 0, '2024-05-15 09:40:00', '2024-05-15 09:40:00'),

-- May 16, 2024
(3, 'CARD', 'LEISURE', -60000, 302000, 242000, '노래방', NULL, 0, '2024-05-16 18:00:00', '2024-05-16 18:00:00'),

-- May 17, 2024
(3, 'CARD', 'FOOD', -5000, 242000, 237000, '파리바게뜨', NULL, 0, '2024-05-17 09:40:00', '2024-05-17 09:40:00'),

-- May 18, 2024
(3, 'CARD', 'FOOD', -7000, 237000, 230000, '스타벅스', NULL, 0, '2024-05-18 09:40:00', '2024-05-18 09:40:00'),

-- May 19, 2024
(3, 'CARD', 'FOOD', -6000, 230000, 224000, '커피빈', NULL, 0, '2024-05-19 09:40:00', '2024-05-19 09:40:00'),

-- May 20, 2024
(3, 'CARD', 'SHOPPING', -40000, 224000, 184000, '이마트', NULL, 0, '2024-05-20 10:00:00', '2024-05-20 10:00:00'),

-- May 21, 2024
(3, 'CARD', 'FOOD', -5000, 184000, 179000, '스타벅스', NULL, 0, '2024-05-21 09:40:00', '2024-05-21 09:40:00'),

-- May 22, 2024
(3, 'CARD', 'LEISURE', -50000, 179000, 129000, '놀이공원', NULL, 0, '2024-05-22 18:00:00', '2024-05-22 18:00:00'),

-- May 23, 2024
(3, 'CARD', 'FOOD', -6000, 129000, 123000, '김밥천국', NULL, 0, '2024-05-23 09:40:00', '2024-05-23 09:40:00'),

-- May 24, 2024
(3, 'CARD', 'FOOD', -5000, 123000, 118000, '스타벅스', NULL, 0, '2024-05-24 09:40:00', '2024-05-24 09:40:00'),
(3, 'CARD', 'SHOPPING', -60000, 118000, 58000, '옵스큐라 성수', NULL, 0, '2024-05-24 12:00:00', '2024-05-24 12:00:00'),
(3, 'CARD', 'LEISURE', -8000, 58000, 50000, '유니온스타 볼링 성수', NULL, 0, '2024-05-24 18:00:00', '2024-05-24 18:00:00'),

-- May 25, 2024
(2, 'TRANSFER', 'TRANSFER', 3000000, 0, 3000000, '5월 급여', NULL, 0, '2024-05-25 09:00:00', '2024-05-25 09:00:00'),
(2, 'TRANSFER', 'TRANSFER', -1800000, 3000000, 1200000, '통장쪼개기 저축 계좌 출금', NULL, 0, '2024-05-25 09:00:01', '2024-05-25 09:00:01'),
(4, 'TRANSFER', 'TRANSFER', 1800000, 1600000, 3400000, '통장쪼개기 저축 계좌 입금', NULL, 0, '2024-05-25 09:00:01', '2024-05-25 09:00:01'),
(2, 'TRANSFER', 'TRANSFER', -900000, 1200000, 300000, '통장쪼개기 생활비 계좌 출금', NULL, 0, '2024-05-25 09:00:01', '2024-05-25 09:00:01'),
(3, 'TRANSFER', 'TRANSFER', 900000, 50000, 950000, '통장쪼개기 생활비 계좌 입금', NULL, 0, '2024-05-25 09:00:01', '2024-05-25 09:00:01'),
(2, 'TRANSFER', 'TRANSFER', -300000, 300000, 0, '통장쪼개기 여비 계좌 출금', NULL, 0, '2024-05-25 09:00:01', '2024-05-25 09:00:01'),
(5, 'TRANSFER', 'TRANSFER', 300000, 1800000, 2100000, '통장쪼개기 여비 계좌 입금', NULL, 0, '2024-05-25 09:00:01', '2024-05-25 09:00:01'),

(7, 'TRANSFER', 'INTEREST', 18473, 3027577, 3046050, '하나 청년도약계좌 적금 이자', NULL, 0, '2024-05-25 09:05:00', '2024-05-25 09:05:00'),
(4, 'TRANSFER', 'TRANSFER', -1000000, 3400000, 2400000, '하나 청년도약계좌 적금 출금', NULL, 0, '2024-05-25 09:10:05', '2024-05-25 09:10:05'),
(7, 'TRANSFER', 'TRANSFER', 1000000, 3046050, 4046050, '하나 청년도약계좌 적금 입금', NULL, 0, '2024-05-25 09:10:05', '2024-05-25 09:10:05'),

(8, 'TRANSFER', 'INTEREST', 3130, 1001562, 1004692, '(내맘) 적금 이자', NULL, 0, '2024-05-25 09:10:05', '2024-05-25 09:10:05'),
(4, 'TRANSFER', 'TRANSFER', -500000, 2400000, 1900000, '(내맘) 적금 출금', NULL, 0, '2024-05-25 09:10:05', '2024-05-25 09:10:05'),
(8, 'TRANSFER', 'TRANSFER', 500000, 1004692, 1504692, '(내맘) 적금 입금', NULL, 0, '2024-05-25 09:10:05', '2024-05-25 09:10:05'),

-- 5월 25일부터 목표 추가(WISH: 전세 자금 마련) + 적금(청년 주택드림 청약통) 추가
(4, 'TRANSFER', 'TRANSFER', -400000, 1900000, 1500000, '청년 주택드림 청약통장 출금', NULL, 0, '2024-05-25 09:10:08', '2024-05-25 09:10:08'),
(9, 'TRANSFER', 'TRANSFER', 400000, 0, 400000, '청년 주택드림 청약통장 입금', NULL, 0, '2024-05-25 09:10:08', '2024-05-25 09:10:08'),

(3, 'CARD', 'SHOPPING', -50000, 950000, 900000, 'EQL', NULL, 0, '2024-05-25 12:00:00', '2024-05-25 12:00:00'),

-- May 26, 2024
(3, 'CARD', 'FOOD', -6000, 900000, 894000, '스타벅스', NULL, 0, '2024-05-26 09:40:00', '2024-05-26 09:40:00'),
(3, 'CARD', 'LEISURE', -70000, 894000, 824000, 'CGV', NULL, 0, '2024-05-26 18:00:00', '2024-05-26 18:00:00'),

-- May 27, 2024
(3, 'CARD', 'FOOD', -5000, 824000, 819000, '스타벅스', NULL, 0, '2024-05-27 09:40:00', '2024-05-27 09:40:00'),

-- May 28, 2024
(3, 'CARD', 'SHOPPING', -90000, 819000, 729000, '롯데마트', NULL, 0, '2024-05-28 10:00:00', '2024-05-28 10:00:00'),

-- May 29, 2024
(3, 'CARD', 'FOOD', -7000, 729000, 722000, '김밥천국', NULL, 0, '2024-05-29 09:40:00', '2024-05-29 09:40:00'),

-- May 30, 2024
(3, 'CARD', 'FOOD', -6000, 722000, 716000, '스타벅스', NULL, 0, '2024-05-30 09:40:00', '2024-05-30 09:40:00'),

-- May 31, 2024
(3, 'CARD', 'LEISURE', -80000, 716000, 636000, '롯데월드', NULL, 0, '2024-05-31 18:00:00', '2024-05-31 18:00:00');

INSERT INTO account_auto_debit (account_id, target_account_id, auto_debit_amount, auto_debit_day, deleted_yn, created_at, updated_at)
VALUES
-- January 25, 2024
(2, 4, 1800000, 25, 0, '2024-01-25 09:00:01', '2024-03-25 09:00:01'),
(2, 3, 900000, 25, 0, '2024-01-25 09:00:01', '2024-03-25 09:00:01'),
(2, 5, 300000, 25, 0, '2024-01-25 09:00:01', '2024-03-25 09:00:01'),
(4, 7, 1000000, 25, 0, '2024-01-25 09:10:05', '2024-01-25 09:10:05'),

-- March 25, 2024
(4, 8, 500000, 25, 0, '2024-03-25 09:10:05', '2024-03-25 09:10:05'),

-- May 25, 2024
(4, 9, 400000, 25, 0, '2024-05-25 09:10:05', '2024-05-25 09:10:05'),
